[M_Sage_Urine MissionDefinition]
MissionDescription="A particularly incontinent skag has been marking his territory all around Claptrap's grove. Even though he does not have a sense of smell, Claptrap would like you to wash off the urine so he won't be attacked and eaten by angry skags. Oh, and the skag's tinkle juice is only visible at night. Have fun!"
TeaserText="When you gotta go..."
